/******************************************************************************
----------------本例程仅供学习使用，未经作者允许，不得用于其他用途。-----------
------------------------版权所有，仿冒必究！-----------------------------------
----------------1.开发环境:Arduino IDE-----------------------------------------
----------------2.测试使用开发板型号：Arduino Leonardo or Arduino UNO R3-------
----------------3.单片机使用晶振：16M------------------------------------------
----------------4.淘宝网址：Ilovemcu.taobao.com--------------------------------
----------------------------epic-mcu.taobao.com--------------------------------
----------------5.作者：神秘藏宝室---------------------------------------------
******************************************************************************/
char inByte = 0; 

void setup() // 开始时调用该函数。用它来初始化变量、引脚模式、使用库等。
{
  Serial.begin(9600);  // 定义一个串口
  pinMode(13,OUTPUT);  // 定义引脚配置为作为输入或输出
}

void loop()  // 连续循环的控制Arduino板
{
  if (Serial.available() > 0) 
  {
    inByte = Serial.read();
    Serial.println(inByte);
  }
  
  digitalWrite(13,HIGH);  // 数字写
  delay(1000);  // 指定暂停程序的时间（以毫秒为单位）
  digitalWrite(13,LOW);
  delay(1000);
}
